
package ru.reksoft.xsdtojava.jaxb;

import javax.xml.bind.annotation.XmlRegistry;


/**
 * This object contains factory methods for each 
 * Java content interface and Java element interface 
 * generated in the ru.reksoft.xsdtojava.jaxb package. 
 * <p>An ObjectFactory allows you to programatically 
 * construct new instances of the Java representation 
 * for XML content. The Java representation of XML 
 * content can consist of schema derived interfaces 
 * and classes representing the binding of schema 
 * type definitions, element declarations and model 
 * groups.  Factory methods for each of these are 
 * provided in this class.
 * 
 */
@XmlRegistry
public class ObjectFactory {


    /**
     * Create a new ObjectFactory that can be used to create new instances of schema derived classes for package: ru.reksoft.xsdtojava.jaxb
     * 
     */
    public ObjectFactory() {
    }

    /**
     * Create an instance of {@link Файл }
     * 
     */
    public Файл createФайл() {
        return new Файл();
    }

    /**
     * Create an instance of {@link Файл.Документ }
     * 
     */
    public Файл.Документ createФайлДокумент() {
        return new Файл.Документ();
    }

    /**
     * Create an instance of {@link Файл.Документ.Подписант }
     * 
     */
    public Файл.Документ.Подписант createФайлДокументПодписант() {
        return new Файл.Документ.Подписант();
    }

    /**
     * Create an instance of {@link Файл.Документ.Подписант.ЮЛ }
     * 
     */
    public Файл.Документ.Подписант.ЮЛ createФайлДокументПодписантЮЛ() {
        return new Файл.Документ.Подписант.ЮЛ();
    }

    /**
     * Create an instance of {@link Файл.Документ.Подписант.ИП }
     * 
     */
    public Файл.Документ.Подписант.ИП createФайлДокументПодписантИП() {
        return new Файл.Документ.Подписант.ИП();
    }

    /**
     * Create an instance of {@link Файл.Документ.Подписант.ФЛ }
     * 
     */
    public Файл.Документ.Подписант.ФЛ createФайлДокументПодписантФЛ() {
        return new Файл.Документ.Подписант.ФЛ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер }
     * 
     */
    public Файл.Документ.СвПродПер createФайлДокументСвПродПер() {
        return new Файл.Документ.СвПродПер();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.ИнфПолФХЖ3 }
     * 
     */
    public Файл.Документ.СвПродПер.ИнфПолФХЖ3 createФайлДокументСвПродПерИнфПолФХЖ3() {
        return new Файл.Документ.СвПродПер.ИнфПолФХЖ3();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер createФайлДокументСвПродПерСвПер() {
        return new Файл.Документ.СвПродПер.СвПер();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз createФайлДокументСвПродПерСвПерТранГруз() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик createФайлДокументСвПродПерСвПерТранГрузПеревозчик() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.БанкРекв }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.БанкРекв createФайлДокументСвПродПерСвПерТранГрузПеревозчикБанкРекв() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.БанкРекв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес createФайлДокументСвПродПерСвПерТранГрузПеревозчикАдрес() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв createФайлДокументСвПродПерСвПерТранГрузПеревозчикИдСв() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвФЛУчастФХЖ }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвФЛУчастФХЖ createФайлДокументСвПродПерСвПерТранГрузПеревозчикИдСвСвФЛУчастФХЖ() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвФЛУчастФХЖ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИП }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИП createФайлДокументСвПродПерСвПерТранГрузПеревозчикИдСвСвИП() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИП();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвЛицПер }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвЛицПер createФайлДокументСвПродПерСвПерСвЛицПер() {
        return new Файл.Документ.СвПродПер.СвПер.СвЛицПер();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо createФайлДокументСвПродПерСвПерСвЛицПерИнЛицо() {
        return new Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ФЛПер }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ФЛПер createФайлДокументСвПродПерСвПерСвЛицПерИнЛицоФЛПер() {
        return new Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ФЛПер();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ПредОргПер }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ПредОргПер createФайлДокументСвПродПерСвПерСвЛицПерИнЛицоПредОргПер() {
        return new Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ПредОргПер();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвЛицПер.РабОргПрод }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвЛицПер.РабОргПрод createФайлДокументСвПродПерСвПерСвЛицПерРабОргПрод() {
        return new Файл.Документ.СвПродПер.СвПер.СвЛицПер.РабОргПрод();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт }
     * 
     */
    public Файл.Документ.ТаблСчФакт createФайлДокументТаблСчФакт() {
        return new Файл.Документ.ТаблСчФакт();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.ВсегоОпл }
     * 
     */
    public Файл.Документ.ТаблСчФакт.ВсегоОпл createФайлДокументТаблСчФактВсегоОпл() {
        return new Файл.Документ.ТаблСчФакт.ВсегоОпл();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.СведТов }
     * 
     */
    public Файл.Документ.ТаблСчФакт.СведТов createФайлДокументТаблСчФактСведТов() {
        return new Файл.Документ.ТаблСчФакт.СведТов();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов }
     * 
     */
    public Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов createФайлДокументТаблСчФактСведТовДопСведТов() {
        return new Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт }
     * 
     */
    public Файл.Документ.СвСчФакт createФайлДокументСвСчФакт() {
        return new Файл.Документ.СвСчФакт();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ИнфПолФХЖ1 }
     * 
     */
    public Файл.Документ.СвСчФакт.ИнфПолФХЖ1 createФайлДокументСвСчФактИнфПолФХЖ1() {
        return new Файл.Документ.СвСчФакт.ИнфПолФХЖ1();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 createФайлДокументСвСчФактДопСвФХЖ1() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор createФайлДокументСвСчФактДопСвФХЖ1СвФактор() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.БанкРекв }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.БанкРекв createФайлДокументСвСчФактДопСвФХЖ1СвФакторБанкРекв() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.БанкРекв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес createФайлДокументСвСчФактДопСвФХЖ1СвФакторАдрес() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв createФайлДокументСвСчФактДопСвФХЖ1СвФакторИдСв() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвФЛУчастФХЖ }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвФЛУчастФХЖ createФайлДокументСвСчФактДопСвФХЖ1СвФакторИдСвСвФЛУчастФХЖ() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвФЛУчастФХЖ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИП }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИП createФайлДокументСвСчФактДопСвФХЖ1СвФакторИдСвСвИП() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИП();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп createФайлДокументСвСчФактСвПокуп() {
        return new Файл.Документ.СвСчФакт.СвПокуп();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.БанкРекв }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.БанкРекв createФайлДокументСвСчФактСвПокупБанкРекв() {
        return new Файл.Документ.СвСчФакт.СвПокуп.БанкРекв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.Адрес }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.Адрес createФайлДокументСвСчФактСвПокупАдрес() {
        return new Файл.Документ.СвСчФакт.СвПокуп.Адрес();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.ИдСв }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.ИдСв createФайлДокументСвСчФактСвПокупИдСв() {
        return new Файл.Документ.СвСчФакт.СвПокуп.ИдСв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ createФайлДокументСвСчФактСвПокупИдСвСвФЛУчастФХЖ() {
        return new Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИП }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИП createФайлДокументСвСчФактСвПокупИдСвСвИП() {
        return new Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИП();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч createФайлДокументСвСчФактГрузПолуч() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.БанкРекв }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.БанкРекв createФайлДокументСвСчФактГрузПолучБанкРекв() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.БанкРекв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.Адрес }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.Адрес createФайлДокументСвСчФактГрузПолучАдрес() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.Адрес();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв createФайлДокументСвСчФактГрузПолучИдСв() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвФЛУчастФХЖ }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвФЛУчастФХЖ createФайлДокументСвСчФактГрузПолучИдСвСвФЛУчастФХЖ() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвФЛУчастФХЖ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИП }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИП createФайлДокументСвСчФактГрузПолучИдСвСвИП() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИП();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт createФайлДокументСвСчФактГрузОт() {
        return new Файл.Документ.СвСчФакт.ГрузОт();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр createФайлДокументСвСчФактГрузОтГрузОтпр() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.БанкРекв }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.БанкРекв createФайлДокументСвСчФактГрузОтГрузОтпрБанкРекв() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.БанкРекв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес createФайлДокументСвСчФактГрузОтГрузОтпрАдрес() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв createФайлДокументСвСчФактГрузОтГрузОтпрИдСв() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвФЛУчастФХЖ }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвФЛУчастФХЖ createФайлДокументСвСчФактГрузОтГрузОтпрИдСвСвФЛУчастФХЖ() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвФЛУчастФХЖ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИП }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИП createФайлДокументСвСчФактГрузОтГрузОтпрИдСвСвИП() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИП();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод createФайлДокументСвСчФактСвПрод() {
        return new Файл.Документ.СвСчФакт.СвПрод();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.БанкРекв }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.БанкРекв createФайлДокументСвСчФактСвПродБанкРекв() {
        return new Файл.Документ.СвСчФакт.СвПрод.БанкРекв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.Адрес }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.Адрес createФайлДокументСвСчФактСвПродАдрес() {
        return new Файл.Документ.СвСчФакт.СвПрод.Адрес();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.ИдСв }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.ИдСв createФайлДокументСвСчФактСвПродИдСв() {
        return new Файл.Документ.СвСчФакт.СвПрод.ИдСв();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ createФайлДокументСвСчФактСвПродИдСвСвФЛУчастФХЖ() {
        return new Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИП }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИП createФайлДокументСвСчФактСвПродИдСвСвИП() {
        return new Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИП();
    }

    /**
     * Create an instance of {@link Файл.СвУчДокОбор }
     * 
     */
    public Файл.СвУчДокОбор createФайлСвУчДокОбор() {
        return new Файл.СвУчДокОбор();
    }

    /**
     * Create an instance of {@link Файл.Документ.Подписант.ЮЛ.ФИО }
     * 
     */
    public Файл.Документ.Подписант.ЮЛ.ФИО createФайлДокументПодписантЮЛФИО() {
        return new Файл.Документ.Подписант.ЮЛ.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.Подписант.ИП.ФИО }
     * 
     */
    public Файл.Документ.Подписант.ИП.ФИО createФайлДокументПодписантИПФИО() {
        return new Файл.Документ.Подписант.ИП.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.Подписант.ФЛ.ФИО }
     * 
     */
    public Файл.Документ.Подписант.ФЛ.ФИО createФайлДокументПодписантФЛФИО() {
        return new Файл.Документ.Подписант.ФЛ.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.ИнфПолФХЖ3 .ТекстИнф }
     * 
     */
    public Файл.Документ.СвПродПер.ИнфПолФХЖ3 .ТекстИнф createФайлДокументСвПродПерИнфПолФХЖ3ТекстИнф() {
        return new Файл.Документ.СвПродПер.ИнфПолФХЖ3 .ТекстИнф();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ОснПер }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ОснПер createФайлДокументСвПродПерСвПерОснПер() {
        return new Файл.Документ.СвПродПер.СвПер.ОснПер();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвПерВещи }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвПерВещи createФайлДокументСвПродПерСвПерСвПерВещи() {
        return new Файл.Документ.СвПродПер.СвПер.СвПерВещи();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.ТранНакл }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.ТранНакл createФайлДокументСвПродПерСвПерТранГрузТранНакл() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.ТранНакл();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Контакт }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Контакт createФайлДокументСвПродПерСвПерТранГрузПеревозчикКонтакт() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Контакт();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.БанкРекв.СвБанк }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.БанкРекв.СвБанк createФайлДокументСвПродПерСвПерТранГрузПеревозчикБанкРеквСвБанк() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.БанкРекв.СвБанк();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес.АдрРФ }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес.АдрРФ createФайлДокументСвПродПерСвПерТранГрузПеревозчикАдресАдрРФ() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес.АдрРФ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес.АдрИнф }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес.АдрИнф createФайлДокументСвПродПерСвПерТранГрузПеревозчикАдресАдрИнф() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.Адрес.АдрИнф();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвЮЛУч }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвЮЛУч createФайлДокументСвПродПерСвПерТранГрузПеревозчикИдСвСвЮЛУч() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвЮЛУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИнНеУч }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИнНеУч createФайлДокументСвПродПерСвПерТранГрузПеревозчикИдСвСвИнНеУч() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИнНеУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвФЛУчастФХЖ.ФИО }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвФЛУчастФХЖ.ФИО createФайлДокументСвПродПерСвПерТранГрузПеревозчикИдСвСвФЛУчастФХЖФИО() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвФЛУчастФХЖ.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИП.ФИО }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИП.ФИО createФайлДокументСвПродПерСвПерТранГрузПеревозчикИдСвСвИПФИО() {
        return new Файл.Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИП.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ФЛПер.ФИО }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ФЛПер.ФИО createФайлДокументСвПродПерСвПерСвЛицПерИнЛицоФЛПерФИО() {
        return new Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ФЛПер.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ПредОргПер.ФИО }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ПредОргПер.ФИО createФайлДокументСвПродПерСвПерСвЛицПерИнЛицоПредОргПерФИО() {
        return new Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ПредОргПер.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвПродПер.СвПер.СвЛицПер.РабОргПрод.ФИО }
     * 
     */
    public Файл.Документ.СвПродПер.СвПер.СвЛицПер.РабОргПрод.ФИО createФайлДокументСвПродПерСвПерСвЛицПерРабОргПродФИО() {
        return new Файл.Документ.СвПродПер.СвПер.СвЛицПер.РабОргПрод.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.ВсегоОпл.СумНалВсего }
     * 
     */
    public Файл.Документ.ТаблСчФакт.ВсегоОпл.СумНалВсего createФайлДокументТаблСчФактВсегоОплСумНалВсего() {
        return new Файл.Документ.ТаблСчФакт.ВсегоОпл.СумНалВсего();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.СведТов.Акциз }
     * 
     */
    public Файл.Документ.ТаблСчФакт.СведТов.Акциз createФайлДокументТаблСчФактСведТовАкциз() {
        return new Файл.Документ.ТаблСчФакт.СведТов.Акциз();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.СведТов.СумНал }
     * 
     */
    public Файл.Документ.ТаблСчФакт.СведТов.СумНал createФайлДокументТаблСчФактСведТовСумНал() {
        return new Файл.Документ.ТаблСчФакт.СведТов.СумНал();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.СведТов.СвТД }
     * 
     */
    public Файл.Документ.ТаблСчФакт.СведТов.СвТД createФайлДокументТаблСчФактСведТовСвТД() {
        return new Файл.Документ.ТаблСчФакт.СведТов.СвТД();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.СведТов.ИнфПолФХЖ2 }
     * 
     */
    public Файл.Документ.ТаблСчФакт.СведТов.ИнфПолФХЖ2 createФайлДокументТаблСчФактСведТовИнфПолФХЖ2() {
        return new Файл.Документ.ТаблСчФакт.СведТов.ИнфПолФХЖ2();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.СведПрослеж }
     * 
     */
    public Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.СведПрослеж createФайлДокументТаблСчФактСведТовДопСведТовСведПрослеж() {
        return new Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.СведПрослеж();
    }

    /**
     * Create an instance of {@link Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов }
     * 
     */
    public Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов createФайлДокументТаблСчФактСведТовДопСведТовНомСредИдентТов() {
        return new Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ИспрСчФ }
     * 
     */
    public Файл.Документ.СвСчФакт.ИспрСчФ createФайлДокументСвСчФактИспрСчФ() {
        return new Файл.Документ.СвСчФакт.ИспрСчФ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПРД }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПРД createФайлДокументСвСчФактСвПРД() {
        return new Файл.Документ.СвСчФакт.СвПРД();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДокПодтвОтгр }
     * 
     */
    public Файл.Документ.СвСчФакт.ДокПодтвОтгр createФайлДокументСвСчФактДокПодтвОтгр() {
        return new Файл.Документ.СвСчФакт.ДокПодтвОтгр();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ИнфПолФХЖ1 .ТекстИнф }
     * 
     */
    public Файл.Документ.СвСчФакт.ИнфПолФХЖ1 .ТекстИнф createФайлДокументСвСчФактИнфПолФХЖ1ТекстИнф() {
        return new Файл.Документ.СвСчФакт.ИнфПолФХЖ1 .ТекстИнф();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .ИнфПродГосЗакКазн }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .ИнфПродГосЗакКазн createФайлДокументСвСчФактДопСвФХЖ1ИнфПродГосЗакКазн() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .ИнфПродГосЗакКазн();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .ОснУстДенТреб }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .ОснУстДенТреб createФайлДокументСвСчФактДопСвФХЖ1ОснУстДенТреб() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .ОснУстДенТреб();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Контакт }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Контакт createФайлДокументСвСчФактДопСвФХЖ1СвФакторКонтакт() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Контакт();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.БанкРекв.СвБанк }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.БанкРекв.СвБанк createФайлДокументСвСчФактДопСвФХЖ1СвФакторБанкРеквСвБанк() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.БанкРекв.СвБанк();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес.АдрРФ }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес.АдрРФ createФайлДокументСвСчФактДопСвФХЖ1СвФакторАдресАдрРФ() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес.АдрРФ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес.АдрИнф }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес.АдрИнф createФайлДокументСвСчФактДопСвФХЖ1СвФакторАдресАдрИнф() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.Адрес.АдрИнф();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвЮЛУч }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвЮЛУч createФайлДокументСвСчФактДопСвФХЖ1СвФакторИдСвСвЮЛУч() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвЮЛУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИнНеУч }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИнНеУч createФайлДокументСвСчФактДопСвФХЖ1СвФакторИдСвСвИнНеУч() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИнНеУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвФЛУчастФХЖ.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвФЛУчастФХЖ.ФИО createФайлДокументСвСчФактДопСвФХЖ1СвФакторИдСвСвФЛУчастФХЖФИО() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвФЛУчастФХЖ.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИП.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИП.ФИО createФайлДокументСвСчФактДопСвФХЖ1СвФакторИдСвСвИПФИО() {
        return new Файл.Документ.СвСчФакт.ДопСвФХЖ1 .СвФактор.ИдСв.СвИП.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.Контакт }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.Контакт createФайлДокументСвСчФактСвПокупКонтакт() {
        return new Файл.Документ.СвСчФакт.СвПокуп.Контакт();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.БанкРекв.СвБанк }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.БанкРекв.СвБанк createФайлДокументСвСчФактСвПокупБанкРеквСвБанк() {
        return new Файл.Документ.СвСчФакт.СвПокуп.БанкРекв.СвБанк();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.Адрес.АдрРФ }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.Адрес.АдрРФ createФайлДокументСвСчФактСвПокупАдресАдрРФ() {
        return new Файл.Документ.СвСчФакт.СвПокуп.Адрес.АдрРФ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.Адрес.АдрИнф }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.Адрес.АдрИнф createФайлДокументСвСчФактСвПокупАдресАдрИнф() {
        return new Файл.Документ.СвСчФакт.СвПокуп.Адрес.АдрИнф();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвЮЛУч }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвЮЛУч createФайлДокументСвСчФактСвПокупИдСвСвЮЛУч() {
        return new Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвЮЛУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИнНеУч }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИнНеУч createФайлДокументСвСчФактСвПокупИдСвСвИнНеУч() {
        return new Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИнНеУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ.ФИО createФайлДокументСвСчФактСвПокупИдСвСвФЛУчастФХЖФИО() {
        return new Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИП.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИП.ФИО createФайлДокументСвСчФактСвПокупИдСвСвИПФИО() {
        return new Файл.Документ.СвСчФакт.СвПокуп.ИдСв.СвИП.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.Контакт }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.Контакт createФайлДокументСвСчФактГрузПолучКонтакт() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.Контакт();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.БанкРекв.СвБанк }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.БанкРекв.СвБанк createФайлДокументСвСчФактГрузПолучБанкРеквСвБанк() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.БанкРекв.СвБанк();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрРФ }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрРФ createФайлДокументСвСчФактГрузПолучАдресАдрРФ() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрРФ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрИнф }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрИнф createФайлДокументСвСчФактГрузПолучАдресАдрИнф() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрИнф();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвЮЛУч }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвЮЛУч createФайлДокументСвСчФактГрузПолучИдСвСвЮЛУч() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвЮЛУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИнНеУч }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИнНеУч createФайлДокументСвСчФактГрузПолучИдСвСвИнНеУч() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИнНеУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвФЛУчастФХЖ.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвФЛУчастФХЖ.ФИО createФайлДокументСвСчФактГрузПолучИдСвСвФЛУчастФХЖФИО() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвФЛУчастФХЖ.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИП.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИП.ФИО createФайлДокументСвСчФактГрузПолучИдСвСвИПФИО() {
        return new Файл.Документ.СвСчФакт.ГрузПолуч.ИдСв.СвИП.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Контакт }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Контакт createФайлДокументСвСчФактГрузОтГрузОтпрКонтакт() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Контакт();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.БанкРекв.СвБанк }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.БанкРекв.СвБанк createФайлДокументСвСчФактГрузОтГрузОтпрБанкРеквСвБанк() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.БанкРекв.СвБанк();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрРФ }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрРФ createФайлДокументСвСчФактГрузОтГрузОтпрАдресАдрРФ() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрРФ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрИнф }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрИнф createФайлДокументСвСчФактГрузОтГрузОтпрАдресАдрИнф() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрИнф();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвЮЛУч }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвЮЛУч createФайлДокументСвСчФактГрузОтГрузОтпрИдСвСвЮЛУч() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвЮЛУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИнНеУч }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИнНеУч createФайлДокументСвСчФактГрузОтГрузОтпрИдСвСвИнНеУч() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИнНеУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвФЛУчастФХЖ.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвФЛУчастФХЖ.ФИО createФайлДокументСвСчФактГрузОтГрузОтпрИдСвСвФЛУчастФХЖФИО() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвФЛУчастФХЖ.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИП.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИП.ФИО createФайлДокументСвСчФактГрузОтГрузОтпрИдСвСвИПФИО() {
        return new Файл.Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИП.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.Контакт }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.Контакт createФайлДокументСвСчФактСвПродКонтакт() {
        return new Файл.Документ.СвСчФакт.СвПрод.Контакт();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.БанкРекв.СвБанк }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.БанкРекв.СвБанк createФайлДокументСвСчФактСвПродБанкРеквСвБанк() {
        return new Файл.Документ.СвСчФакт.СвПрод.БанкРекв.СвБанк();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.Адрес.АдрРФ }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.Адрес.АдрРФ createФайлДокументСвСчФактСвПродАдресАдрРФ() {
        return new Файл.Документ.СвСчФакт.СвПрод.Адрес.АдрРФ();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.Адрес.АдрИнф }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.Адрес.АдрИнф createФайлДокументСвСчФактСвПродАдресАдрИнф() {
        return new Файл.Документ.СвСчФакт.СвПрод.Адрес.АдрИнф();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвЮЛУч }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвЮЛУч createФайлДокументСвСчФактСвПродИдСвСвЮЛУч() {
        return new Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвЮЛУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИнНеУч }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИнНеУч createФайлДокументСвСчФактСвПродИдСвСвИнНеУч() {
        return new Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИнНеУч();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ.ФИО createФайлДокументСвСчФактСвПродИдСвСвФЛУчастФХЖФИО() {
        return new Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ.ФИО();
    }

    /**
     * Create an instance of {@link Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИП.ФИО }
     * 
     */
    public Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИП.ФИО createФайлДокументСвСчФактСвПродИдСвСвИПФИО() {
        return new Файл.Документ.СвСчФакт.СвПрод.ИдСв.СвИП.ФИО();
    }

    /**
     * Create an instance of {@link Файл.СвУчДокОбор.СвОЭДОтпр }
     * 
     */
    public Файл.СвУчДокОбор.СвОЭДОтпр createФайлСвУчДокОборСвОЭДОтпр() {
        return new Файл.СвУчДокОбор.СвОЭДОтпр();
    }

}
